{"Scenarios": [
    {"name": "Common Bias assistant",
     "executerMessage": "Your task is to receive feedback from the other agent and then answer the user's questions.",
     "agents": [
        {"name": "biasAssistant", 
         "systemMessage": "Check if there is bias in the executer's answer. If so, let the executer know."
        }
     ]
    },
    {"name": "Bias specialists",
    "executerMessage": "Your task is to receive feedback from the other agents and then answer the user's questions.",
    "agents": [
       {"name": "genderAssistant", 
        "systemMessage": "Check if there is gender bias in the executer's answer. If so, let the executer know."
       },
       {"name": "culturalAssistant", 
        "systemMessage": "Check if there is cultural bias in the executer's answer. If so, let the executer know."
       },
       {"name": "ageAssistant", 
        "systemMessage": "Check if there is age bias in the executer's answer. If so, let the executer know."
       },
       {"name": "ethnicityAssistant", 
        "systemMessage": "Check if there is ethnicity bias in the executer's answer. If so, let the executer know."
       },
       {"name": "raceAssistant", 
        "systemMessage": "Check if there is race bias in the executer's answer. If so, let the executer know."
       },
       {"name": "disabilitiesAssistant", 
        "systemMessage": "Check if there is disability bias in the executer's answer. If so, let the executer know."
       },
       {"name": "socialAssistant", 
        "systemMessage": "Check if there is social bias in the executer's answer. If so, let the executer know."
       },
       {"name": "democracyAssistant", 
        "systemMessage": "Check if there is democracy bias in the executer's answer. If so, let the executer know."
       },
       {"name": "religionAssistant", 
        "systemMessage": "Check if there is religion bias in the executer's answer. If so, let the executer know."
       },
       {"name": "sexualAssistant", 
        "systemMessage": "Check if there is sexual orientation bias in the executer's answer. If so, let the executer know."
       }
    ]
   },
   {"name": "Ethic board",
   "executerMessage": "Your task is to receive feedback from the other agents and then answer the user's questions.",
   "agents": [
      {"name": "ethicalExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are ethics problems. If so, let the executer know."
      },
      {"name": "lawyerExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are legal problems. If so, let the executer know."
      },
      {"name": "socialExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are social problems. If so, let the executer know."
      },
      {"name": "technologyExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are technology problems. If so, let the executer know."
      },
      {"name": "psychologicExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are psychologic problems. If so, let the executer know."
      },
      {"name": "interestExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are interest problems. If so, let the executer know."
      },
      {"name": "diversityExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are diversity problems. If so, let the executer know."
      },
      {"name": "philosophyExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are philosophy problems. If so, let the executer know."
      },
      {"name": "healthExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are health problems. If so, let the executer know."
      },
      {"name": "sustainabilityExpertAssistant", 
       "systemMessage": "You are part of the ethics board. Your task is to let the executer know if there are sustainability problems. If so, let the executer know."
      }
   ]
  }
]
}